wsoph/xiaozhi-esp32-maomi/main/audio/audio_service.cc
void AudioService::ResumeVoiceUpload() { voice_upload_gate_.Resume(); }

void AudioService::SetDiscardVoiceUploadOnWake(bool enabled) {
    discard_voice_upload_on_wake_.store(enabled, std::memory_order_release);
}

void AudioService::DiscardVoiceUploadBacklog() {
    // Suspend first so no packet can obtain a new send authorization while the
    // queued and in-progress encoding work is invalidated.
    voice_upload_gate_.Suspend();
    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    audio_send_queue_.clear();
    timestamp_queue_.clear();
    for (auto it = audio_encode_queue_.begin(); it != audio_encode_queue_.end();) {
        if ((*it)->type == kAudioTaskTypeEncodeToSendQueue) {
            it = audio_encode_queue_.erase(it);
        } else {
            ++it;
        }
    }
    audio_queue_cv_.notify_all();
}

void AudioService::EncodeWakeWord() {
    if (audio_engine_) {
        audio_engine_->EncodeWakeWordData();
    }
}

const std::string& AudioService::GetLastWakeWord() const {
    static const std::string empty;
    return audio_engine_ ? audio_engine_->GetLastDetectedWakeWord() : empty;
}

std::unique_ptr<AudioStreamPacket> AudioService::PopWakeWordPacket() {
    auto packet = std::make_unique<AudioStreamPacket>();
    if (audio_engine_ && audio_engine_->GetWakeWordOpus(packet->payload)) {
        return packet;
    }
    return nullptr;
}

void AudioService::EnableWakeWordDetection(bool enable) {
    ESP_LOGD(TAG, "%s wake word detection", enable ? "Enabling" : "Disabling");
    if (enable) {
        if (!InitializeAudioEngine()) {
            xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
            return;
        }
#if !(CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32S31)
        auto* lite_engine = static_cast<LiteAudioEngine*>(audio_engine_.get());
        if (!lite_engine->RestoreWakeWordResources()) {
            xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
            return;
        }
#endif
        if (!audio_engine_->HasWakeWord()) {
            xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
            return;
        }
        {
            std::lock_guard<std::mutex> lock(input_resampler_mutex_);
            if (input_resampler_ != nullptr) {
                esp_ae_rate_cvt_reset(input_resampler_);
            }
        }
        audio_engine_->EnableWakeWordDetection(true);
        xEventGroupSetBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
    } else {
        if (audio_engine_initialized_) {
            audio_engine_->EnableWakeWordDetection(false);
        }
        xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
    }
}

void AudioService::ReleaseWakeWordResources() {
#if !(CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32S31)
    if (!audio_engine_initialized_) {
        return;
    }
    if (xEventGroupGetBits(event_group_) &
        (AS_EVENT_WAKE_WORD_RUNNING | AS_EVENT_AUDIO_PROCESSOR_RUNNING)) {
        ESP_LOGW(TAG, "Cannot release WakeNet while the audio engine is active");
        return;
    }
    static_cast<LiteAudioEngine*>(audio_engine_.get())->ReleaseWakeWordResources();
#endif
}

void AudioService::EnableVoiceProcessing(bool enable) {
    ESP_LOGD(TAG, "%s voice processing", enable ? "Enabling" : "Disabling");

    if (enable) {
        voice_upload_gate_.Resume();
        if (!InitializeAudioEngine()) {
            return;
        }
        ResetDecoder();
        audio_input_need_warmup_ = true;
        {
            std::lock_guard<std::mutex> lock(input_resampler_mutex_);
            if (input_resampler_ != nullptr) {
                esp_ae_rate_cvt_reset(input_resampler_);
            }
        }
        audio_engine_->EnableVoiceProcessing(true);
        xEventGroupSetBits(event_group_, AS_EVENT_AUDIO_PROCESSOR_RUNNING);
    } else {
        if (audio_engine_initialized_) {
            audio_engine_->EnableVoiceProcessing(false);
        }
        xEventGroupClearBits(event_group_, AS_EVENT_AUDIO_PROCESSOR_RUNNING);
    }
}

void AudioService::EnableAudioTesting(bool enable) {
    ESP_LOGI(TAG, "%s audio testing", enable ? "Enabling" : "Disabling");
    if (enable) {
        xEventGroupSetBits(event_group_, AS_EVENT_AUDIO_TESTING_RUNNING);
    } else {
        xEventGroupClearBits(event_group_, AS_EVENT_AUDIO_TESTING_RUNNING);
        /* Copy audio_testing_queue_ to audio_decode_queue_ */
        std::lock_guard<std::mutex> lock(audio_queue_mutex_);
        audio_decode_queue_ = std::move(audio_testing_queue_);
        if (!audio_decode_queue_.empty()) {
            playback_drained_notified_ = false;
        }
        audio_queue_cv_.notify_all();
    }
}

void AudioService::EnableDeviceAec(bool enable) {
    ESP_LOGI(TAG, "%s device AEC", enable ? "Enabling" : "Disabling");
    device_aec_enabled_ = enable;

    if (audio_engine_initialized_) {
        audio_engine_->EnableDeviceAec(enable);
    } else {
        ESP_LOGI(TAG, "Deferring AEC change until the audio engine is initialized");
    }
}

void AudioService::SetCallbacks(AudioServiceCallbacks& callbacks) { callbacks_ = callbacks; }

bool AudioService::PlaySound(const std::string_view& ogg) {
    if (!codec_->output_enabled()) {
        esp_timer_stop(audio_power_timer_);
        esp_timer_start_periodic(audio_power_timer_, AUDIO_POWER_CHECK_INTERVAL_MS * 1000);
        codec_->EnableOutput(true);
    }

    const auto* buf = reinterpret_cast<const uint8_t*>(ogg.data());
    const size_t size = ogg.size();
    bool queued = true;
    try {
        OggDemuxer demuxer;
        demuxer.OnPacket(
            [&](const uint8_t* data, int sample_rate, int frame_duration_ms, size_t packet_size) {
                if (!queued) {
                    return;
                }
                auto packet = std::make_unique<AudioStreamPacket>();
                packet->sample_rate = sample_rate;
                packet->frame_duration = frame_duration_ms;
                packet->payload.assign(data, data + packet_size);
                queued = PushPacketToDecodeQueue(std::move(packet), true);
            });
        if (demuxer.Process(buf, size) != size || !demuxer.Finish() || !queued) {
            ResetDecoder();
            ESP_LOGE(TAG, "Refusing invalid, incomplete, or unqueueable Ogg Opus sound");
            return false;
        }
    } catch (const std::bad_alloc&) {
        ResetDecoder();
        ESP_LOGE(TAG, "Not enough memory to stream Ogg Opus sound");
        return false;
    }
    return true;
}

bool AudioService::TryPlaySound(const std::string_view& ogg, bool wait, uint32_t playback_id) {
    const auto* buf = reinterpret_cast<const uint8_t*>(ogg.data());
    const size_t size = ogg.size();

    if (!wait && !NonBlockingSoundLimits::AcceptsContainerSize(size)) {
        ESP_LOGE(TAG, "Refusing empty or oversized nonblocking Ogg container");
        return false;
    }

    if (wait) {
        size_t packet_count = 0;
        OggDemuxer validator;
        validator.OnPacket([&](const uint8_t*, int, int, size_t) { ++packet_count; });
        if (validator.Process(buf, size) != size || !validator.Finish()) {
            ESP_LOGE(TAG, "Refusing invalid or incomplete Ogg Opus sound");
            return false;
        }

        if (!codec_->output_enabled()) {
            esp_timer_stop(audio_power_timer_);
            esp_timer_start_periodic(audio_power_timer_, AUDIO_POWER_CHECK_INTERVAL_MS * 1000);
            codec_->EnableOutput(true);
        }

        bool queued = true;
        try {
            OggDemuxer demuxer;
            demuxer.OnPacket([&](const uint8_t* data, int sample_rate, int frame_duration_ms,
                                 size_t packet_size) {
                if (!queued) {
                    return;
                }
                auto packet = std::make_unique<AudioStreamPacket>();
                packet->sample_rate = sample_rate;
                packet->frame_duration = frame_duration_ms;
                packet->payload.assign(data, data + packet_size);
                if (--packet_count == 0 && playback_id != 0) {
                    packet->playback_id = playback_id;
                    packet->playback_end = true;
                }
                queued = PushPacketToDecodeQueue(std::move(packet), true);
            });
            if (demuxer.Process(buf, size) != size || !demuxer.Finish() || !queued) {
                ResetDecoder();
                return false;
            }
        } catch (const std::bad_alloc&) {
            ResetDecoder();
            ESP_LOGE(TAG, "Not enough memory to queue Ogg Opus sound");
            return false;
        }
        return true;
    }

    std::vector<std::unique_ptr<AudioStreamPacket>> pending_packets;
    bool within_bounds = true;
    NonBlockingSoundBudget sound_budget;
    try {
        OggDemuxer demuxer;
        demuxer.OnPacket([&](const uint8_t* data, int sample_rate, int frame_duration_ms,
                             size_t packet_size) {
            if (!within_bounds) {
                return;
            }
            if (!sound_budget.TryAddPacket(packet_size, static_cast<uint32_t>(frame_duration_ms))) {
                within_bounds = false;
                return;
            }
            auto packet = std::make_unique<AudioStreamPacket>();
            packet->sample_rate = sample_rate;
            packet->frame_duration = frame_duration_ms;
            packet->payload.assign(data, data + packet_size);
            pending_packets.push_back(std::move(packet));
        });
        if (demuxer.Process(buf, size) != size || !demuxer.Finish() || !within_bounds ||
            pending_packets.empty()) {
            ESP_LOGE(TAG, "Refusing invalid, incomplete, or oversized Ogg Opus sound");
            return false;
        }
    } catch (const std::bad_alloc&) {
        ESP_LOGE(TAG, "Not enough memory to prepare Ogg Opus sound");
        return false;
    }

    if (playback_id != 0) {
        pending_packets.back()->playback_id = playback_id;
        pending_packets.back()->playback_end = true;
    }

    if (!codec_->output_enabled()) {
        esp_timer_stop(audio_power_timer_);
        esp_timer_start_periodic(audio_power_timer_, AUDIO_POWER_CHECK_INTERVAL_MS * 1000);
        codec_->EnableOutput(true);
    }

    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    if (service_stopped_.load() ||
        audio_decode_queue_.size() > NonBlockingSoundLimits::kMaxPackets ||
        pending_packets.size() > NonBlockingSoundLimits::kMaxPackets - audio_decode_queue_.size()) {
        return false;
    }

